Courses/4420/Lectures/LinuxSetup/StudyPrograms/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-08-29 Thu 20:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Studying a Few Tiny Programs</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Studying a Few Tiny Programs</h1>

<div id="outline-container-org2860e30" class="outline-2">
<h2 id="org2860e30"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>The dir <a href="../StudyPrograms">../StudyPrograms</a> has several tiny files of C src code. <code>ls -lg</code></li>
</ol>

<div class="org-src-container">
<pre class="src src-ls">-rw-r--r-- 1 pmateti   494 Aug 29 19:52 arrays.c
-rw-r--r-- 1 pmateti   228 Aug 29 19:52 example1.c
-rw-r--r-- 1 pmateti   270 Aug 29 19:52 example2.c
-rw-r--r-- 1 pmateti   159 Aug 29 19:52 execsh.c
-rw-r--r-- 1 pmateti    59 Aug 29 19:52 exit.c
-rw-r--r-- 1 pmateti 17775 Aug 29 20:42 index.html
-rw-r--r-- 1 pmateti  5137 Aug 29 20:42 index.org
-rw-r--r-- 1 pmateti   403 Aug 29 19:52 Makefile
-rw-r--r-- 1 pmateti   450 Aug 29 19:52 recurse.c
-rw-r--r-- 1 pmateti  1817 Aug 29 20:08 recurse.s
-rw-r--r-- 1 pmateti 16848 Aug 29 20:32 syslib
-rw-r--r-- 1 pmateti   415 Aug 29 19:52 syslib.c
-rw-r--r-- 1 pmateti   387 Aug 29 19:52 testsc.c
-rw-r--r-- 1 pmateti   776 Aug 29 19:52 yasc.c
</pre>
</div>

<ol class="org-ol">
<li>Study the source to see what syscalls and library calls they make,
and how the programs are to be built, and the numerical
relationships between the addresses of variables.</li>

<li>What is the max amount of virtual memory can a Linux process have?</li>

<li>All these programs are expected to be invoked as non-root.</li>
</ol>
</div>
</div>


<div id="outline-container-orgb5cd4d5" class="outline-2">
<h2 id="orgb5cd4d5"><span class="section-number-2">2</span> <a href="./Makefile">./Makefile</a></h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li><code>make</code> will compile and link one program with no error messages.
It is using the <code>Makefile</code> as-is, and <code>CFLAGS = -g -Wall -ansi
   -pedantic</code> Explain what these flags cause <code>gcc</code> to do.  Expand the
<code>Makefile</code> to become complete, so that all included programs in the
directory are built properly.</li>
</ol>
</div>
</div>


<div id="outline-container-org324bebb" class="outline-2">
<h2 id="org324bebb"><span class="section-number-2">3</span> <a href="./example1.c">./example1.c</a></h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Understand how arguments are passed to parameters.</li>
<li>E.g., how does <code>function(1, 2, 3);</code> in main pass arguments to
procedure named <code>function</code>?</li>
</ol>
</div>
</div>

<div id="outline-container-org74f8078" class="outline-2">
<h2 id="org74f8078"><span class="section-number-2">4</span> <a href="./example2.c">./example2.c</a></h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>Lookup the man page of <code>strcpy</code>.</li>
<li>In C, a string is an array of chars ending in '\0' (ASCII NUL).</li>
<li>Spot sloppy programming.</li>
</ol>
</div>
</div>

<div id="outline-container-org5575ee8" class="outline-2">
<h2 id="org5575ee8"><span class="section-number-2">5</span> <a href="./execsh.c">./execsh.c</a></h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>Learn to use <code>execve</code></li>
<li><code>name</code> is an array of pointers to strings.</li>
<li>What is volume or section 2 of man pages?</li>
</ol>
</div>
</div>

<div id="outline-container-org50897e8" class="outline-2">
<h2 id="org50897e8"><span class="section-number-2">6</span> <a href="./exit.c">./exit.c</a></h2>
<div class="outline-text-2" id="text-6">
<ol class="org-ol">
<li>How many system calls does this tiny program have?</li>
<li>Tradition is that Unix/Linux processes return, as they terminate,
(i) a zero on "success", (ii) a negative integer on error(s).</li>
</ol>
</div>
</div>

<div id="outline-container-orgd2fa81a" class="outline-2">
<h2 id="orgd2fa81a"><span class="section-number-2">7</span> <a href="./recurse.c">./recurse.c</a></h2>
<div class="outline-text-2" id="text-7">
<ol class="org-ol">
<li><code>gcc</code> generates code for functions such that the return value is in
the "accumulator" register A (RAX/ EAX/ AX/ &#x2026;).</li>

<li>Try <code>gcc -s recurse.c</code>.  Figure out what it does.</li>

<li>What are "segment registers"? What is a "Segmentation Fault"?</li>

<li><code>get_sp()</code> is written in Gnu Assembly.  It copies the stack pointer
register (SP ) to the A register.</li>

<li>On my Linux PC, invoking it as in <code>; ./recurse</code> prints</li>
</ol>
<pre class="example">
x 0 sp fea65670
x 1 sp fe965650
x 2 sp fe865630
x 3 sp fe765610
x 4 sp fe6655f0
x 5 sp fe5655d0
x 6 sp fe4655b0
Segmentation fault (core dumped)

</pre>
<p>
before dying.  My prompt string <code>PS1</code> is <code>;</code>  .
</p>
<ol class="org-ol">
<li>Improve [whatever] so that it recurses more deeply.  Explain what
you did.</li>
<li>Must leave the array <code>a</code> the same.</li>
</ol>
</div>
</div>

<div id="outline-container-org89c5926" class="outline-2">
<h2 id="org89c5926"><span class="section-number-2">8</span> <a href="./arrays.c">./arrays.c</a></h2>
<div class="outline-text-2" id="text-8">
<ol class="org-ol">
<li>Study its output.</li>
<li>Learn
<ol class="org-ol">
<li><code>sizeof</code></li>
<li>address computations.</li>
<li>the syntax of printf format string.</li>
</ol></li>
<li>If we were to exchange the two lines <code>char b[5]; char c[3];</code>,
predict what the output will be [without re-compiling/ running].</li>
</ol>
</div>
</div>


<div id="outline-container-org2f6ef7f" class="outline-2">
<h2 id="org2f6ef7f"><span class="section-number-2">9</span> <a href="./testsc.c">./testsc.c</a></h2>
<div class="outline-text-2" id="text-9">
<ol class="org-ol">
<li>This may appear tricky, but this kind of code is quite common in
systems programming.</li>
<li>The bytes stored in <code>scb[]</code> are the x86 machine code manually
produced by compiling the so-called "shell code", which invokes the
shell through a system call.</li>
<li><code>rap</code> stands for return-address-ptr.</li>
<li>First, experience the code by compiling and linking the code as in,
<code>gcc testsc.c -o testsc</code>, and invoking it.</li>
<li>Invoking <code>testsc</code> as produced above, as-is, is going to produce
<code>*** stack smashing detected ***: &lt;unknown&gt; terminated; Aborted
   (core dumped)"</code></li>
<li>Re-compilining as in <code>gcc -fno-stack-protector -z execstack
   testsc.c -o testsc</code>, and invoking will terminate "silently".  What
did it do?  We explore this topic in a few weeks under the topic of
"stack smashing."</li>
</ol>
</div>
</div>

<div id="outline-container-org614bb71" class="outline-2">
<h2 id="org614bb71"><span class="section-number-2">10</span> <a href="./yasc.c">./yasc.c</a></h2>
<div class="outline-text-2" id="text-10">
<ol class="org-ol">
<li>Similar to the above.</li>
<li>Explains the bytes stored in <code>sc[]</code> in the comments.</li>
<li>The ptr <code>fp</code> stores the address of a void method that takes no
arguments.</li>
<li>In <code>(void *) sc</code> the <code>(void *)</code> is doing free type coercion.  "Free"
because this is happening at compile time, not run time. The type
of <code>sc</code>, which is <code>char []</code> is being coerced into a <code>void *</code>.  [Are
parens necessary here?  [Advice: When in doubt, parenthesize!]]</li>
</ol>
</div>
</div>

<div id="outline-container-orgf0500c9" class="outline-2">
<h2 id="orgf0500c9"><span class="section-number-2">11</span> <a href="./syslib.c">./syslib.c</a></h2>
<div class="outline-text-2" id="text-11">
<ol class="org-ol">
<li>Library Calls v. SysCalls</li>
<li>Build <code>syslib</code>.  Explain the output.</li>
</ol>
</div>
</div>

<div id="outline-container-orgfc347ff" class="outline-2">
<h2 id="orgfc347ff"><span class="section-number-2">12</span> References</h2>
<div class="outline-text-2" id="text-12">
<ol class="org-ol">
<li>Wikibooks,
<a href="https://en.wikibooks.org/wiki/X86_Assembly/X86_Architecture">https://en.wikibooks.org/wiki/X86_Assembly/X86_Architecture</a>, 2019.</li>
</ol>
</div>
</div>

<div id="outline-container-orgcffa6ac" class="outline-2">
<h2 id="orgcffa6ac"><span class="section-number-2">13</span> End</h2>
<div class="outline-text-2" id="text-13">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2019 <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2019-08-29
</div>
</body>
</html>
